run/cokeCombustion/T673_Pe1e-3_ExternalSurface/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

// startFrom       startTime;
startFrom       latestTime;
startTime       0;

stopAt          endTime;

// endTime         1e-2;
endTime         100;

deltaT          1e-9;

writeControl    adjustableRunTime;

// writeInterval   1e-2;
writeInterval   0.5;


purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   7;

runTimeModifiable yes;

adjustTimeStep  yes;
// adjustTimeStep  off;

maxCo           1000;

maxDeltaT       1e-5;

autoTimeStepControl               true;

stableStageStartTime              0.01;

stableStageMaxDeltaT              10e-4;

chemicalTimeStepMagnification     70.0;

functions
{
    // #includeFunc  residuals
    #includeFunc  minMaxComponents
    // #includeFunc singleGraph
}

// ************************************************************************* //
